app/controllers/articles_controller.rb

  def create
    @article = current_user.articles.build(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hello"], ["body", "hello hello"], ["created_at", "2022-10-20 03:40:16.199188"], ["updated_at", "2022-10-20 03:40:16.199188"]]